my_dict = {'C1': [10, 20, 30, 7, 6, 23, 90], 'C2': [20, 30, 40, 1, 2, 3, 90, 12], 'C3': [12, 34, 20, 21],
           'C4': [22, 54, 209, 21, 7], 'C5': [2, 4, 29, 21, 19], 'C6': [4, 6, 7, 10, 55], 'C7': [4, 8, 12, 23, 42],
           'C8': [3, 14, 15, 26, 48], 'C9': [2, 7, 18, 28, 18, 28]}

# m = my_dict.copy()
#
#
# for k, v in m.items():
#     for j in v:
#         print(v)
#         if j > 20:
#             my_dict[k].remove(j)
#             print(j)
# print(my_dict)   Не правильно, потому что списки внутри словаря тоже ссылочки)

my_dict = {k: [_ for _ in v if _ < 20] for k, v in my_dict.items()}
print(my_dict)
